argandas/STM32F746G-DISCO_TouchGFX_Demo-1/Core/Src/main.cpp
  /*Configure GPIO pins : ARDUINO_A4_Pin ARDUINO_A5_Pin ARDUINO_A1_Pin ARDUINO_A2_Pin 
                           ARDUINO_A3_Pin */
  GPIO_InitStruct.Pin = ARDUINO_A4_Pin|ARDUINO_A5_Pin|ARDUINO_A1_Pin|ARDUINO_A2_Pin 
                          |ARDUINO_A3_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOF, &GPIO_InitStruct);

  /*Configure GPIO pins : ULPI_STP_Pin ULPI_DIR_Pin */
  GPIO_InitStruct.Pin = ULPI_STP_Pin|ULPI_DIR_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF10_OTG_HS;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  /*Configure GPIO pin : RMII_RXER_Pin */
  GPIO_InitStruct.Pin = RMII_RXER_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(RMII_RXER_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : ARDUINO_A0_Pin */
  GPIO_InitStruct.Pin = ARDUINO_A0_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(ARDUINO_A0_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : DCMI_HSYNC_Pin PA6 */
  GPIO_InitStruct.Pin = DCMI_HSYNC_Pin|GPIO_PIN_6;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  GPIO_InitStruct.Alternate = GPIO_AF13_DCMI;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /*Configure GPIO pins : ULPI_CLK_Pin ULPI_D0_Pin */
  GPIO_InitStruct.Pin = ULPI_CLK_Pin|ULPI_D0_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF10_OTG_HS;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /*Configure GPIO pin : ARDUINO_PWM_D6_Pin */
  GPIO_InitStruct.Pin = ARDUINO_PWM_D6_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  GPIO_InitStruct.Alternate = GPIO_AF9_TIM12;
  HAL_GPIO_Init(ARDUINO_PWM_D6_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : ARDUINO_MISO_D12_Pin ARDUINO_MOSI_PWM_D11_Pin */
  GPIO_InitStruct.Pin = ARDUINO_MISO_D12_Pin|ARDUINO_MOSI_PWM_D11_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  GPIO_InitStruct.Alternate = GPIO_AF5_SPI2;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

}

/* USER CODE BEGIN 4 */

uint16_t cli_printf(const char* fmt, ...)
{
  uint16_t len = 0;
  va_list args;
  va_start(args, fmt);
  vsnprintf(cli_buff, sizeof(cli_buff), fmt, args);
  // tfp_vsnprintf(cli_buff, sizeof(cli_buff), fmt, args);
  len = cli_write(&cli_buff[0], strlen(cli_buff));
  va_end(args);    

  return len;
}

void jsmn_parser_example(char* json_string, uint16_t len)
{
  int i;
  int r;
  jsmn_parser p;
  jsmntok_t t[128]; /* We expect no more than 128 tokens */

  jsmn_init(&p);
  r = jsmn_parse(&p, json_string, len, t, sizeof(t)/sizeof(t[0]));
  if (r < 0) {
          cli_printf("Failed to parse JSON: %d\r\n", r);
          //return 1;
  }

  /* Assume the top-level element is an object */
  if (r < 1 || t[0].type != JSMN_OBJECT) {
          cli_printf("Object expected\r\n");
          // return 1;
  }

  /* Loop over all keys of the root object */
  for (i = 1; i < r; i++) {
          if (jsoneq(json_string, &t[i], "channel_id") == 0) {
                  /* We may use strndup() to fetch string value */
                  cli_printf("- Channel ID: %.*s\r\n", t[i+1].end-t[i+1].start,
                                  json_string + t[i+1].start);
                  i++;
          } else if (jsoneq(json_string, &t[i], "entry_id") == 0) {
                  /* We may additionally check if the value is either "true" or "false" */
                  cli_printf("- Entry ID: %.*s\r\n", t[i+1].end-t[i+1].start,
                                  json_string + t[i+1].start);
                  i++;
          } else if (jsoneq(json_string, &t[i], "field1") == 0) {
                  /* We may want to do strtol() here to get numeric value */
                  cli_printf("- Field1: %.*s\r\n", t[i+1].end-t[i+1].start,
                                  json_string + t[i+1].start);
                  i++;
          } else if (jsoneq(json_string, &t[i], "groups") == 0) {
                  int j;
                  cli_printf("- Groups:\r\n");
                  if (t[i+1].type != JSMN_ARRAY) {
                          continue; /* We expect groups to be an array of strings */
                  }
                  for (j = 0; j < t[i+1].size; j++) {
                          jsmntok_t *g = &t[i+j+2];
                          cli_printf("  * %.*s\r\n", g->end - g->start, json_string + g->start);
                  }
                  i += t[i+1].size + 1;
          } else {
                  cli_printf("Unexpected key: %.*s\r\n", t[i].end-t[i].start,
                                  json_string + t[i].start);
          }
  }
}


uint16_t cli_write(const char* src, uint16_t len)
{
  if ((src != NULL) && (len > 0))
  {
    HAL_UART_Transmit(&huart1, (uint8_t*)src, len, 100);
    // HAL_UART_Transmit(&huart6, (uint8_t*)src, len, 100);
  }
  return len;
}

FRESULT get_free_clusters(FATFS* fs)
{
    FRESULT fr;
    DWORD fre_clust, fre_sect, tot_sect;

    /* Get volume information and free clusters of used drive */
    fr = f_getfree((TCHAR const*)SDPath, &fre_clust, &fs);
    cli_printf("f_getfree: %d\r\n", fr);

    if (fr == FR_OK)
    {
      /* Get total sectors and free sectors */
      tot_sect = (fs->n_fatent - 2) * fs->csize;
      fre_sect = fre_clust * fs->csize;

      /* Print the free space (assuming 512 bytes/sector) */
      cli_printf("%10lu KiB total drive space.\r\n", tot_sect/2);
      cli_printf("%10lu KiB available space.\r\n", fre_sect/2);
    }
    
    return fr;
}

/* Start node to be scanned (***also used as work area***) */
FRESULT scan_files(char* path)
{
    FRESULT res;
    DIR dir;
    UINT i;
    static FILINFO fno;

    res = f_opendir(&dir, path);                       /* Open the directory */
    if (res == FR_OK) {
        for (;;) {
            res = f_readdir(&dir, &fno);                   /* Read a directory item */
            if (res != FR_OK || fno.fname[0] == 0) break;  /* Break on error or end of dir */
            if (fno.fattrib & AM_DIR) {                    
                /* It is a directory */
                i = strlen(path);
                sprintf(&path[i], "/%s (%4d bytes)", fno.fname, fno.fsize);
                res = scan_files(path);                    /* Enter the directory */
                if (res != FR_OK) break;
                path[i] = 0;
            }
            else 
            {                                       
                /* It is a file. */
                cli_printf("%s/%s  (%4d bytes)\r\n", path, fno.fname, fno.fsize);
            }
        }
        f_closedir(&dir);
    }

    return res;
}

