argandas/STM32F746G-DISCO_TouchGFX_Demo-1/Core/Src/main.cpp
  /*##-12 - Scan files in the device ###############################*/
  fr = get_free_clusters(&SDFatFs);

  /*##-13- Unlink the micro SD disk I/O driver ###############################*/
  cli_printf("FATFS %s\r\n", "End");
  FATFS_UnLinkDriver(SDPath);
  
#endif
  /* Infinite loop */
  for(;;)
  {
    osDelay(1);
  }
  /* USER CODE END StartSDTask */
}

/* USER CODE BEGIN Header_StartLWIPTask */
/**
* @brief Function implementing the lwipTask thread.
* @param argument: Not used
* @retval None
*/
portCHAR PAGE_BODY[256];

/* USER CODE END Header_StartLWIPTask */
void StartLWIPTask(void const * argument)
{
  /* USER CODE BEGIN StartLWIPTask */

  /* Queue PV */
  uint8_t queueData = 0;

  /* LwIP PV */
  struct netif* netif = (struct netif*)argument;
  struct netconn *conn;
  struct netbuf *netbuf = NULL;
  ip4_addr_t local_ip; 
  ip4_addr_t remote_ip; 
  err_t netErr;
  
  /* Temp Buffer PV */
  char* temp_buf_data = NULL;
  uint16_t temp_buf_data_len = 0;
  lwhttp_message_header_t* temp_header_ptr;
  lwhttp_message_header_t* content_type_header_ptr;
  
  /* JSON PV */
  const char* json_data_fmt = "{\"api_key\": \"%s\", \"delta_t\": %d, \"field1\": %d}";
  uint8_t json_data[128];
  uint8_t json_data_len[4];
  
  /* Thingspeak server PV */
  const char* key = "WTN6FH385TCUNDMU";
  const char* server = "thingspeak.com";
  const char* url = "/update.json?headers=false";
  
  /* init code for LWIP */
  MX_LWIP_Init();
  
  /* Check interface status */
  if (netif_is_up(netif))
  {
    DHCP_state = DHCP_START;
  }
  else
  {  
    DHCP_state = DHCP_LINK_DOWN;
    cli_printf("The network cable is not connected \r\n");
  }

  /* Infinite loop */
  for(;;)
  {
    if(xQueueReceive(tcpQueueHandle, &queueData, 0) == pdTRUE)
    {
      cli_printf("[Queue] Model -> %s (queueData = %u)\r\n", __func__, queueData);
      
      /* Parse HTTP Body in JSON format */
      sprintf((char *)json_data, json_data_fmt, key, 5, queueData);  
      sprintf((char *)json_data_len, "%d", strlen((char *)json_data));  
      
      /* LwHTTP Request Builder */
      lwhttp_request_init(&httpRequest);
      lwhttp_request_put_request_line(&httpRequest, LwHHTP_POST, url);
      // lwhttp_request_put_message_header(&httpRequest, "Host", "www.sensait.com"); /* Required for HTTP/1.1 */
      lwhttp_request_put_message_header(&httpRequest, "Content-Type", "application/json");
      lwhttp_request_put_message_header(&httpRequest, "Content-Length", (char *)json_data_len);
      lwhttp_request_put_message_body(&httpRequest, (char*)json_data, strlen((char *)json_data));      
      
      /* LwHTTP Response Builder */
      lwhttp_response_init(&httpResponse);  

      /* Init error as fatal */
      netErr = ERR_ABRT;
      
      /* Send HTTP Request */
      if (DHCP_state == DHCP_ADDRESS_ASSIGNED)
      {
        /* Create a new TCP connection handle */
        conn = netconn_new(NETCONN_TCP);        
        if (conn == NULL)
        {
          netErr = ERR_CONN;
          cli_printf("[LWIP] netconn_new : FAILED\r\n");
        }
        else
        {
#if 0 
          /* Bind a netconn to a specific local IP address and port (optional) */
          netErr = netconn_bind(conn, &netif->ip_addr, 0 );
          if (netErr != ERR_OK)
          {
            cli_printf("[LWIP] netconn_bind: ERR (%d)\r\n", netErr);
          }
          else
#endif
          {
            netErr = netconn_gethostbyname(server, &remote_ip);
            if (netErr != ERR_OK)
            {
              cli_printf("[LWIP] netconn_gethostbyname: ERR (%d)\r\n", netErr);
            }
            else
            {
              cli_printf("Remote IP address to server: %s [%s]\r\n", server, ip4addr_ntoa((const ip4_addr_t *)&remote_ip));
              
              /* Connect to server */
              netErr = netconn_connect(conn, &remote_ip, 80); 
              if (netErr != ERR_OK)
              {
                cli_printf("[LWIP] netconn_connect: ERR (%d)\r\n", netErr);
              }
              else
              {
                cli_printf("Connected to server: %s\r\n", server);
                
        /* Print LwHTTP Request */
        lwhttp_request_get(&httpRequest, &temp_buf_data, &temp_buf_data_len);
        cli_printf("[LwHTTP] Request: (%d bytes):\r\n[START]\r\n", temp_buf_data_len);
        cli_write(temp_buf_data, temp_buf_data_len);
        cli_printf("\r\n[END]\r\n\r\n");

                /* Write data to server */
                netErr = netconn_write(conn, temp_buf_data, temp_buf_data_len, NETCONN_NOFLAG);
                if (netErr != ERR_OK)
                {
                  cli_printf("[LWIP] netconn_write: ERR (%d)\r\n", netErr);
                }                
              }
            }
          }
        }
        
        /* Request Sent, get response */
        if (netErr == ERR_OK)
        {                     
          /* Get pointer to buffer where response data is stored */
          while (( netErr = netconn_recv(conn, &netbuf)) == ERR_OK)
          {
              do
              {
                /* Get pointer to data and length*/
                netbuf_data(netbuf, (void**)&temp_buf_data, &temp_buf_data_len);
                
                /* LwHTTP write response to parser */
                lwhttp_response_put(&httpResponse, (char*)temp_buf_data, temp_buf_data_len);
              }
              while (netbuf_next(netbuf) >= 0);
              
              /* Free data buffer */
              netbuf_delete(netbuf);
          }
          
          if ((netErr != ERR_OK) && (netErr != ERR_CLSD))
          {
            cli_printf("[LWIP] netconn_recv: ERR (%d)\r\n", netErr);
          }
        }
        
        /* Run LwHTTP Response Parser */
        lwhttp_request_parse(&httpRequest);
        lwhttp_response_parse(&httpResponse);
        
        /* Print LwHTTP Request */
        lwhttp_request_get(&httpRequest, &temp_buf_data, &temp_buf_data_len);
        cli_printf("[LwHTTP] Request: (%d bytes):\r\n[START]\r\n", temp_buf_data_len);
        cli_write(temp_buf_data, temp_buf_data_len);
        cli_printf("\r\n[END]\r\n\r\n");

        /* Print LwHTTP Response */
        lwhttp_response_get(&httpResponse, &temp_buf_data, &temp_buf_data_len);
        cli_printf("[LwHTTP] Response: (%d bytes):\r\n[START]\r\n", temp_buf_data_len);
        cli_write(temp_buf_data, temp_buf_data_len);
        cli_printf("\r\n[END]\r\n\r\n");
        
        /* Print LwHTTP Response Status Line */
        lwhttp_response_get_status_line(&httpResponse, &temp_buf_data, &temp_buf_data_len);
        cli_printf("[LwHTTP] Response Start-Line: >>>%.*s<<<\r\n", temp_buf_data_len, temp_buf_data);
        
        /* Print LwHTTP Response Status Line */
        lwhttp_request_get_request_line(&httpRequest, &temp_buf_data, &temp_buf_data_len);
        cli_printf("[LwHTTP] Request Start-Line: >>>%.*s<<<\r\n", temp_buf_data_len, temp_buf_data);
        
